Revit 2027 API
BuiltInFailures.FamilyFailures.ProfileContainsNoLoops Property
 Profile type '[Family Symbol]' contains no loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProfileContainsNoLoops { get; }
Public Shared ReadOnly Property ProfileContainsNoLoops As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProfileContainsNoLoops {
	FailureDefinitionId^ get ();
}
static member ProfileContainsNoLoops : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace